{
  "releases": [
    {
      "id": 1,
      "title": "Release Notes Page",
      "version": "0.0.1",
      "date": "4/29/2022",
      "description": "release notes page added",
      "newFeatures": [
        {
          "feature": "Added release notes page for users and developers to track new features"
        }
      ],
      "bugFixes": [
        {
          "bug": "Users can now submit words with capital or lowercase letters, the checking is no longer case sensitive."
        },
        {
          "bug": "Users are no longer allowed to submit numeric values to the global daily game."
        }
      ],
      "improvements": [
        {
          "improvement": "Icon color and size styling is improved on the release notes page."
        }
      ],
      "additionalResources": [
        {
          "additionalResource": "View the release notes page for reference at: https://thewordguessgame.com/releaseNotes"
        }
      ],
      "notification": {
        "title": "Update",
        "description": "You no longer have to worry about capitalization in your guesses"
      }
    },
    {
      "id": 2,
      "title": "Logo",
      "version": "0.0.1",
      "date": "4/30/2022",
      "description": "new logo added",
      "improvements": [
        {
          "improvement": "New logo has been added and color schemes are beginning to be applied throught the site."
        }
      ],
      "notification": {
        "title": "New logo and color scheme",
        "description": "Our branding has improved with a logo and color scheme!"
      }
    },
    {
      "id": 3,
      "title": "Subscribe",
      "version": "0.0.1",
      "date": "5/1/2022",
      "description": "Add your email to our subscription service to get emailed the latest and greatest game features to stay up to date with our game progress!",
      "newFeatures": [
        {
          "feature": "Users can submit their email for subscription to get latest news and updates on our game"
        }
      ],
      "notification": {
        "title": "Subscription emails are here",
        "description": "Users can now opt in to submitting their email to get the latest newsletters on the newest updates and features. Don't worry, we won't spam you"
      }
    },
    {
      "id": 4,
      "title": "Answers shown upon failure",
      "version": "0.0.1",
      "date": "5/2/2022",
      "description": "If a user is unsuccessful on guessing the correct guess, they are now notified of the correct answer.",
      "newFeatures": [
        {
          "feature": "Users are now shown the correct answer whether they guess the correct answer before their attempts are up or if their attempts are up they are shown the answer"
        }
      ],
      "notification": {
        "title": "Answers shown",
        "description": "Answers in the global daily guess game are now shown when a user does not guess the correct guess in their amount of attempts"
      }
    }
  ]
}
